---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.OverallLegend
source: html/3a590b8a-b0d3-fba1-8844-61d2c4cabeca.htm
---
# Autodesk.Revit.DB.GroupTypeId.OverallLegend Property

Overall Legend.

## Syntax (C#)
```csharp
public static ForgeTypeId OverallLegend { get; }
```